app/views/posts/_comment.html.erb

  <h2>Comments</h2>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]