app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asd"], ["content", "asd"], ["user_id", 1], ["created_at", "2016-11-23 02:50:42.856023"], ["updated_at", "2016-11-23 02:50:42.856023"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "https://i.ytimg.com/vi/tntOCGkgt98/maxresdefault.jpg"], ["updated_at", "2016-12-14 00:58:26.101941"], ["id", 1]]